//
//  Questions.swift
//  Meditory
//
//  Created by hyunsic on 8/6/25.
//

struct Questions {
  static let allergy = [
    "홍삼, 사상자, 산수유",
    "강황",
    "달맞이꽃종자유",
    "프로폴리스",
    "석류",
    "소맥 (보리)",
    "밀 또는 밀 단백질",
    "특정 단백질",
    "무화과",
    " 난황 (계란)",
    " 대두",
    " 호박씨",
    " 국화과 ( 쑥갓, 카모마일, 해바라기 씨 등)",
    " 유제품 또는 유당불내증",
    " 호프추출물",
    " 땅콩",
    " 옻",
    " 갑각류 (게, 새우 등)",
    " 에스트로겐 민감",
    " 카페인 민감",
    " 특정 알러지 (예, 원인을 알 수 없는 알러지)",
  ]
  static let diseases = [
    "간 질환",
    "갑상선 질환",
    "고칼슘혈증",
    "고혈압",
    "골다공증",
    "담낭 질환",
    "당뇨 질환",
    "뼈/관절 질환",
    "신장 질환",
    "심장 질환 (심근경색, 스텐트 시술 등)",
    "알레르기 질환 (비염, 결막염 등)",
    "위장 질환",
    "저혈압",
    "천식",
    "혈관 질환 (이상지질혈증 등)",
    "혈액응고관련 질환",
    "수술 전후",
    "각종 암",
    "피부 광과민성",
  ]
  static let medication = [
    "고지혈증약",
    "고혈압약",
    "당뇨약",
    "면역억제제",
    "부정맥치료제",
    "비스테로이드성 항염증제",
    "신경안정제",
    "위산분비억제제",
    "중추신경억제제",
    "항우울증약",
    "항응고증약",
    "항혈소판제",
    "항혈전제",
    "혈전용해제",
    "호르몬제",
    "수면유도제",
    "신장에 영향을 미치는 약품",
  ]
}
